/*
 * 11_Mnogomern_massivyi.c
 * 
 * Многомерные массивы
//--------------------------------------------------------------------
	Можно определять многомерные массивы, элементы таких массивов
	сами в свою очередь являются массивами, в которых также элементы
	могут быть массивами. 
	
	int matr[3][5]; // 3 строки и 5 столбцов
	 
	matr[0][0] matr[0][1] matr[0][2] matr[0][3] matr[0][4]
	matr[1][0] matr[1][1] matr[1][2] matr[1][3] matr[1][4]
	matr[2][0] matr[2][1] matr[2][2] matr[2][3] matr[2][4]
//--------------------------------------------------------------------
	Можно объявлять массивы размерностью больше 2-ух
	int box[2][3][6]; // 2 матрицы по 3 строки из 6 столбцов
//--------------------------------------------------------------------
	Пример 
	
	int a[3][3];
	for(int i=0; i < 3; i++)
		{
			for(int j=0; j < 3; j++)
				{
					a[i][j] = i *3 +j;
				}
		}
//--------------------------------------------------------------------
*/

#include <stdio.h>

//--------------------------------------------------------------------
//Написать функцию, которая выводит на печать матрицу
//--------------------------------------------------------------------
void print_matrix_1 (int m, int n, int *a)
{
	int i, j;
	for (i = 0; i < m; i++)
		{
			for (j = 0; j < n; j++)
				{
					printf ("%5d ", a[i * n + j]);
				}
			printf ("\n");
		}
}

void print_matrix_2 (int m, int n, int a[m][n])
{
	int i, j;
	for (i = 0; i < m; i++)
		{
			for (j = 0; j < n; j++)
				{
					printf ("%6d ", a[i][j]);
				}
			printf ("\n");
		}
}

int main(int argc, char **argv)
{
	int matr[3][5]={{1,2,3,4,5,}, {11,22,33,44,55}, {111,222,333,444,555}};
	print_matrix_1 (3,5,(int*)matr);
	//print_matrix_2(3,5,matr);
 return 0;
}

