/*-------------------------------------------------------------------
 * B0.c
 * ------------------------------------------------------------------
 * Максимальный блок
 * ------------------------------------------------------------------
 Описана структура данных
typedef struct list 
{
    uint64_t address;
    size_t size;
    char comment[64];
    struct list *next;
} list;
 
Требуется реализовать только одну функцию, которая в данном списке 
находит адрес блока памяти занимающий больше всего места.
Адрес хранится в поле address, поле size - соответствующий размер 
данного блока. Если список пустой, то функция должна возвращать 0. 
Если есть несколько таких блоков, то вернуть адрес любого из них.
Прототип функции: uint64_t findMaxBlock(list *head)
------------------------------------------------------------------
*/


#include <stdio.h>      // printf, fprintf
#include <stdlib.h>     // malloc, free
#include <stdint.h>     // uintptr_t, uint64_t
#include <string.h>     // snprintf

//=========================================================================================
//   Описание узла списка
//==========================================================================================
typedef struct list         
{
    uint64_t address;          
    size_t size;            
    char comment[64];      
    struct list *next;      
} list;    
            

//=====================================================================================
uint64_t findMaxBlock(list *head)
{
    uint64_t max_addr = 0;
    // Если список пуст — удалять нечего
    if (head == NULL)
    {
        return 0;
    }
//---------------------------------------------------------------------------------------
//Если мы получили адрес и он оказался адресом головы списка:
//----------------------------------------------------------------------------------------
    for( ;head != NULL; head = head->next)
    {
        if(head->address >= max_addr)// head->address — поле address у текущего узла
        {
            max_addr = head->address;
        }
       
    }

    return max_addr;
}

//===============================================================================================
//   Пример использования
//==============================================================================================
int main(void) 
{
   
    return 0;
}