//--------------------------------------------------------
//Операция побитовое И может быть использована для быстрой проверки
//чётности числа.
//--------------------------------------------------------

#include <stdio.h>
#include <stdint.h>
//#include <inttypes.h>



int main(void) 
{
    int32_t x = 17;
    int32_t y = 18;
    (x & 1) ? printf("x = %d Odd-Нечётный\n", x) : printf("x = %d Even-Чётный\n", x);
    (y & 1) ? printf("y = %d Odd-Нечётный\n", y) : printf("y = %d Even-Чётный\n",y);

    return 0;
}