/*
//------------------------------------------------------ 
//              Сравним Arduino и STM32
//------------------------------------------------------
//              Arduino
//------------------------------------------------------
Достоинства Arduino:
● Низкий порог входа и интуитивная понятность.
● Разнообразие плат и расширений к ним.
● Удобно реализовано управление библиотеками.

Недостатки Arduino:
● Все очень упрощено. Некоторые функции отсутствуют.
Если некоторые функции отсутствуют в стандартной
библиотеке, то добавить их Вам будет крайне трудно.
● Скорость выполнения процедур платой крайне низкая.
● Отсутствие такой полезной опции как отладка.

//------------------------------------------------------
//              CubeMX
//------------------------------------------------------
Достоинства CubeMX. Программа, которая позволяет:
● Подобрать микроконтроллер по заданным
характеристикам.
● Выбрать необходимую в проекте периферию.
● Сгенерировать проект для конкретного IDE, который можно
выбрать из списка.

//------------------------------------------------------
//              STM32
//------------------------------------------------------
Достоинства STM32:
Широкий функционал программного
обеспечения.
Скорость работы.
Отладка.

Недостатки STM32:
Не интуитивно понятный интерфейс.
Сложность/необходимость настройки
периферии.
Заметно меньше готовых библиотек.

*/

#include <stdio.h>      // printf, perror

int main(void)
{
    
    return 0;
}