#define LED_BLUE_USER   11            // внешний синий светодиод
#define LED_RED_USER    10            // внешний красный светодиод
#define LED_GREEN_USER   9            // внешний зеленый светодиод

#define DELAY         10              //задержка для светодиодов
#define SHIM         255              //задержка для светодиодов
#define MOVE_TIMEOUT 5000            // время ожидания ввода равное 10 секундам


//---------------------------------------------------------------------------------------------
// Прототипы функций
//---------------------------------------------------------------------------------------------
void blue();
void red();
void green();
void light_blue();
void yellow();
void orange();
void violet();

//---------------------------------------------------------------------------------------------
// Глобальные переменныке и объекты
//---------------------------------------------------------------------------------------------
bool lastBtnState = HIGH;           // Предыдущее состояние кнопки (HIGH = не нажата при INPUT_PULLUP)
bool btnState = 0;                  //Состояние кнопки текущее
int lastPos = 0;                    // Предыдущее положение потенциометра (для отслеживания изменения)
unsigned long lastMoveTime = 0;      // время последнего начала отсчета до выхода из режима настройки

//---------------------------------------------------------------------------------------------
// Настройка платы
//---------------------------------------------------------------------------------------------
void setup() {  
  pinMode(LED_BLUE_USER, OUTPUT);    
  pinMode(LED_RED_USER, OUTPUT); 
  pinMode(LED_GREEN_USER, OUTPUT); 
  Serial.begin(9600);               // Запускаем последовательный порт на скорости 9600 бод
}

//---------------------------------------------------------------------------------------------
// Главный цикл
//---------------------------------------------------------------------------------------------
void loop() {
  blue();
  //---------------------------------------------------------------------------------------------
  //delay(DELAY);                               // Пауза 30 мс перед новым циклом
  //---------------------------------------------------------------------------------------------
  red();
  //---------------------------------------------------------------------------------------------
  //delay(DELAY);                               // Пауза 30 мс перед новым циклом
  //---------------------------------------------------------------------------------------------
  green();
  //---------------------------------------------------------------------------------------------
  //delay(DELAY);                               // Пауза 30 мс перед новым циклом
  //---------------------------------------------------------------------------------------------
  light_blue();
  //---------------------------------------------------------------------------------------------
  delay(DELAY);                               // Пауза 30 мс перед новым циклом
  //---------------------------------------------------------------------------------------------
  yellow();
  //---------------------------------------------------------------------------------------------
  //delay(DELAY);                               // Пауза 30 мс перед новым циклом
  //---------------------------------------------------------------------------------------------
  orange();
  //---------------------------------------------------------------------------------------------
  //delay(DELAY);                               // Пауза 30 мс перед новым циклом
  //---------------------------------------------------------------------------------------------
  violet();
  //---------------------------------------------------------------------------------------------
  //delay(DELAY);                               // Пауза 30 мс перед новым циклом

}

//---------------------------------------------------------------------------------------------
//  Синий
//---------------------------------------------------------------------------------------------
void blue(){
  for (int i = 0; i<SHIM; i++) {
    analogWrite(LED_BLUE_USER, i);
    delay (10);
  }
  delay(DELAY);
  for (int i=SHIM; i>=0; i--)
  {
    analogWrite(LED_BLUE_USER, i);
    delay(10);
  }
}
//---------------------------------------------------------------------------------------------
//  Красный
//---------------------------------------------------------------------------------------------
void red(){
  for (int i = 0; i<SHIM; i++) {
    analogWrite(LED_RED_USER, i);
    delay (10);
  }
  delay(DELAY);
  for (int i=SHIM; i>=0; i--)
  {
    analogWrite(LED_RED_USER, i);
    delay(10);
  }
}
//---------------------------------------------------------------------------------------------
//  Зелёный
//---------------------------------------------------------------------------------------------
void green(){
  for (int i = 0; i<SHIM; i++) {
    analogWrite(LED_GREEN_USER, i);
    delay (10);
  }
  delay(DELAY);
  for (int i=SHIM; i>=0; i--)
  {
    analogWrite(LED_GREEN_USER, i);
    delay(10);
  }
}
//---------------------------------------------------------------------------------------------
//  Голубой
//---------------------------------------------------------------------------------------------
void light_blue(){
  analogWrite(LED_RED_USER, 0);
  int b=60;
  int g=255;
  for (int i = 0; i<SHIM; i++) {
    if(i<b){
      analogWrite(LED_BLUE_USER, i);
    }
    if(i<g){
      analogWrite(LED_GREEN_USER, i);
    }
    delay (10);
  }
  delay(DELAY);
  for (int i=SHIM; i>=0; i--)
  {
    if(i<b){
      analogWrite(LED_BLUE_USER, i);
    }
    if(i<g){
      analogWrite(LED_GREEN_USER, i);
    }
    delay(10);
  }
}
//---------------------------------------------------------------------------------------------
//  Желтый
//---------------------------------------------------------------------------------------------
void yellow(){
  analogWrite(LED_BLUE_USER, 0);
  int r=47;
  int g=255;
  for (int i = 0; i<SHIM; i++) {
    if(i<r){
      analogWrite(LED_RED_USER, i);
    }
    if(i<g){
      analogWrite(LED_GREEN_USER, i);
    }
    delay (10);
  }
  delay(DELAY);
  for (int i=SHIM; i>=0; i--)
  {
    if(i<r){
      analogWrite(LED_RED_USER, i);
    }
    if(i<g){
      analogWrite(LED_GREEN_USER, i);
    }
    delay(10);
  }
}
//---------------------------------------------------------------------------------------------
//  Оранжевый
//---------------------------------------------------------------------------------------------
void orange(){
  analogWrite(LED_BLUE_USER, 0);
  int r=125;
  int g=255;
  for (int i = 0; i<SHIM; i++) {
    if(i<r){
      analogWrite(LED_RED_USER, i);
    }
    if(i<g){
      analogWrite(LED_GREEN_USER, i);
    }
    delay (10);
  }
  delay(DELAY);
  for (int i=SHIM; i>=0; i--)
  {
    if(i<r){
      analogWrite(LED_RED_USER, i);
    }
    if(i<g){
      analogWrite(LED_GREEN_USER, i);
    }
    delay(10);
  }
}
//---------------------------------------------------------------------------------------------
//  Фиолетовый
//---------------------------------------------------------------------------------------------
void violet(){
  analogWrite(LED_GREEN_USER, 0);
  for (int i = 0; i<SHIM; i++) {
    analogWrite(LED_RED_USER, i);
    analogWrite(LED_BLUE_USER, i);
    delay (10);
  }
  delay(DELAY);
  for (int i=SHIM; i>=0; i--)
  {
    analogWrite(LED_RED_USER, i);
    analogWrite(LED_BLUE_USER, i);
    delay(10);
  }
}
//---------------------------------------------------------------------------------------------

  
  
 

