/*
 * void_funkcii.c
 * 
 * Если функция не возвращает никакого значения,
	то в качестве типа возвращаемого значения
	указывается void
 * 
 */
#include <stdio.h>

//----------------------------------------------------------
// Первый вариант
//-------------------------------------------------------
/*
void max (int a, int b)
{
	if (a>b)
		{
			printf("%d\n",a);
		}
	else
		{
			printf("%d\n",b);
		}
}




int main()
{
	int a, b; // локальные переменные
	scanf("%d%d", &a, &b);
	max(a,b);
	return 0;
}
*/
//----------------------------------------------------------
// Второй вариант
//-------------------------------------------------------
void max (void)
{
	int a, b; // локальные переменные
	scanf("%d%d", &a, &b);
	if (a>b)
		{
			printf("%d\n",a);
		}
	else
		{
			printf("%d\n",b);
		}
}


int main()
{
	
	max();
	return 0;
}
