/*
 * S3_9.c
 * 
 //----------------------------------------------------------------
	Многомерные массивы
//-----------------------------------------------------------------
	По сути, двумерный массив является фактически одномерным
	массивом, каждый элемент которого в свою очередь также является
	одномерным массивом.
	
								
				
	int **  -->	a[0]	-->	a[0][0]		a[0][1]		a[0][2]		a[0][3]		a[0][4]
								1			2			3			4			5
				a[1]	-->	a[1][0]		a[1][1]		a[1][2]		a[1][3]		a[1][4]
								6			7			8			9			10	
				a[2]	-->	a[2][0]		a[2][1]		a[2][2]		a[2][3]		a[2][4]
								11			12			13			14			15
				a[3]	-->	a[3][0]		a[3][1]		a[3][2]		a[3][3]		a[3][4]
								16			17			18			19			20
								
				a[i][j] <=> *(*(a+i)+j)
				
	Пример
	
	А можно объявить указатель на строку матрицы
	
 */


#include <stdio.h>
#include <stdlib.h>

int main()
{
	int matr[3][2];
	int (*pm)[2]; //указатель на строку из 2-ух int
/*
				a[0][0]		a[0][1]		
					1			2		
				a[1][0]		a[1][1]		
					3			4				
				a[2][0]		a[2][1]		
					5			6		
						
 */
	pm = matr;
	pm[1][1] = 123; //теперь все ок
	printf("%d\n",matr[1][1]); // 123
	
	return 0;
}

