/*
  razmer_perem_in_mem.c
	Объявление переменных
 */


#include <stdio.h>

int main()
{
	
	int a=3; // объявление целочисленной переменной
	float f; // объявление вещественной переменной
	int su7=2, prime=7, five=5; // объявление переменных с инициализацией
	float pi=3.14; // объявление переменных с инициализацией
	char c, c2='A', m=10; // объявление символьных переменных с инициализацией
	double big_pi; // объявление вещественной переменной двойной точности
	
	
	printf("%lld",sizeof(big_pi)); // забегая вперед
	return 0;
}

