#ifndef LIB_2_H
#define LIB_2_H

#include <stdlib.h>
#include <inttypes.h>

#define SIZE 30
//-----------------------------------------------------------------
typedef struct sensor sensor_t; //Переопределим тип для дальнейшего удобства
typedef struct data data_t; //Переопределим тип для дальнейшего удобства
//--------------------------------------------------------------------	
//----------------------------------------------------------------
//Ключевое слово struct, за ним название структуры sensor 
struct sensor //Заполним поля структуры
	{//Лучше начинать с самых больших полей, это связано с последующим выравниваем
		uint16_t year; //т.к год 2025, то используем тип uint_16 - самое большое поле
		uint8_t day;// день
		uint8_t month; //месяц		
		int8_t t;		//температура
	};//Между }; можем объявить переменную этого типа }template = {0,0,0,0}; 
	//а можем и не объявлять
//----------------------------------------------------------------
struct data
	{
		uint32_t number;
		struct sensor info[SIZE];
	};
//----------------------------------------------------------------
union sensor_serdes
	{
		data_t _data;
		uint8_t bytes[sizeof(struct data)];
	};


//--------------------------------------------------------------------	
void AddRecord(sensor_t info[], int number, uint16_t year,uint8_t month, uint8_t day,int8_t t);
//-------------------------------------------------------------------
int AddInfo(sensor_t info[]);
//----------------------------------------------------------------
void print(sensor_t info[],int number);
//------------------------------------------------------------------
void cgangeIJ(sensor_t info[],int i, int j); //Функция смены позиций двух элементов массива
//--------------------------------------------------------------
/*упорядочивающую его по неубыванию температуры
 * Здесь все довольно просто
*/
void SortByT(sensor_t info[],int n);
//--------------------------------------------------------------
/* По дате ситуация несколько сложнее, потому что дата имеет несколько полей,
 * год, месяц и день. есть два подхода.
 */	
//-------------------------------------------------------------
 unsigned int DateToInt(sensor_t info[]);

//другой подход
// 2. можно написать специальную функцию Compare
//---------------------------------
//Избавились от (int(*) (const void*, const void *)) в функции qsort
//int Compare(sensor_t* a,sensor_t* b)
int Compare(const void* va,const void* vb);//такие замены
//--------------------------------------------------------------
//1. можно написать так 
//упорядочивающую его по дате
void SortByDate(sensor_t info[],int n);
//-----------------------------------------------------------------
//Запишем данные в бинарный файл
//---------------------------------------------------------------	
void save_bin(sensor_t info[],int number); //Открыли файл на запись
//-----------------------------------------------------------------
//Считаем данные из бинарного файла
//---------------------------------------------------------------	
void load_bin(sensor_t info[],int number);	//Открыли файл на чтение	
//-----------------------------------------------------------------
//Добавим количество элементов с которыми мы работаем. Запишем их в начало файла 
//Считаем данные из бинарного файла
//---------------------------------------------------------------
void load_bin_d(data_t* d);
//-----------------------------------------------------------------
//Добавим количество элементов с которыми мы работаем. Запишем их в начало файла 
//Запишем данные в бинарный файл
//---------------------------------------------------------------	
void save_bin_d(data_t* d);
//---------------------------------------------------------------
void load_bin_des(union sensor_serdes * d);
void save_bin_ser(union sensor_serdes* d);
//---------------------------------------------------------------	

#endif