/*
 * S3_3.c
 * 
	При вычитании одного указателя из другого, вычисляется
	разность адресов, которая затем делится на размер (в байтах)
	элемента массива.
	Результатом является количество элементов массива,
	расположенных между данными указателями
//-------------------------------------------------------------	
	Примеры Адресной арифметики
//-------------------------------------------------------------	
	a[0]					p = &a[4]
	a[1]					q = &a[6]
	a[2]					q - 2 => p
	a[3]	<-- p-1			q - p => 2
	a[4]	<-- p			p + 2 => q
	a[5]	<-- p+1			p < q => true
	a[6]	<-- q			p + 1 == q - 1
 *  a[7]					p[3] => a[7]
 * 							p[-2] => a[2]
 * 							&a[8] - &a[0] => 8
 * //----------------------------------------------------------
 */


#include <stdio.h>
#include <stdlib.h>
#include <inttypes.h>

int main()
{
	int a[5] = {10,20,30,40,50};
	int *pa, *qa;
	pa = &a[1];
	qa = &a[3];
	printf("%p - %p = %ld\n", qa, pa, qa-pa);// 0x7ffeef3ce61c - 0x7ffeef3ce614 = 2

	char *ka, *ha;
	ka = (char *)&a[1];
	ha = (char *)&a[3];
	// Это уже выведется в байтах
	printf("%p - %p = %ld\n", ka, ha, ka-ha);// x7ffeef3ce614 - 0x7ffeef3ce61c = -8


	return 0;
}

