/*
 * S2_7.c
 * Циклический сдвиг массива влево на 1 элемент
	Реверс массива
	Сортировка пузырьком
	Сортировка выбором
 * 
 * 
 */
#include <stdio.h>
#include <stdlib.h>

enum {SIZE = 10, SEED = 123};
//-----------------------------------------------------------------
//Заполнение массива случайными числами
//-----------------------------------------------------------------
int random_number(int n) 
	{
		return rand() % n;
	}
void init_array(int size, int a[], int max_random) 
	{
		for (size_t i = 0; i < size; i++ )
			{
				a[i] = random_number(max_random) - max_random/2;
			}
	}
//-----------------------------------------------------------------
//Вывод массива на экран
//-----------------------------------------------------------------
void print_array(int size, int a[]) 
{
	for (size_t i = 0; i < size; i++ )
		{
			printf("%d ",a[i]);
		}
		printf("\n");
	return;
}
//-------------------------------------------------------------
//Циклический сдвиг массива влево на 1 элемент
//----------------------------------------------------
void shift_array_left(int size, int a[]) 
{
	int tmp=a[0];
	for (size_t i=0; i < size-1; i++ ) 
		{
		//	a[i] = a[i+1];	//Можно так
			*(a+i) = *(a+i+1);//А можно сделать и через указатель
		// Результат одинаковый
		}
	a[size-1] = tmp;
}

//-----------------------------------------------------------------
//Замена двух элементов массива
//Реверс массива
//-----------------------------------------------------------------
void swap(int*a,int*b)
{
	int t = *a;
	*a = *b;
	*b = t;
}
void revers_array(int size, int a[]) 
{
	for(size_t i=0; i<size/2; i++) // Идем до середины массива 
									// и меняем с начала и с конца
		{
		//	swap(&a[i], &a[size-1-i]);//Можно так
			swap(a+i, a+size-1-i);//А можно и так
		}
	return;
}
//-----------------------------------------------------------------
//Сортировка пузырьком
//-----------------------------------------------------------------
void buble_sort_array(int size, int a[]) 
{
	int i = 0;
	_Bool flag;
	do 
		{
			flag = 0; // сбросить флаг
			for (int j = size-2; j >= i ; j-- )
				{
					if ( a[j] > a[j+1] ) 
						{
							swap(&a[j], &a[j+1]);
							flag = 1; // поднять флаг если есть обмен
						}		
				}
			i++;
		}
	while ( flag ); // выход при flag = 0
}
//-----------------------------------------------------------------
//Сортировка выбором
//-----------------------------------------------------------------
void choose_sort_array(int size, int a[]) 
{
	int nMin=a[0];
	for(int i = 0; i < size-1 ; i ++ ) 
		{
			for (int j = i+1; j < size; j ++)
				{
					if( a[j] < a[nMin] )
						{
							nMin = j;
						}				
					if( nMin != i ) 
						{
							swap(&a[i], &a[nMin]);
						}
				}
		}
}
//----------------------------------------------------
int main(void)
{
	int a[SIZE];
	//srand(SEED);
	init_array(SIZE, a, 100);
	print_array(SIZE,a);
	shift_array_left(SIZE,a);	//Циклический сдвиг массива влево на 1 элемент
	print_array(SIZE,a);
	revers_array(SIZE,a);		//Реверс всего массива
	print_array(SIZE,a);
	revers_array(SIZE/2,a);	//Реверс одной половины массива
	print_array(SIZE,a);
	revers_array(SIZE/2,a+SIZE/2);	//Реверс обоих половин массива 
									//независимо друг от друга
	print_array(SIZE,a);
	buble_sort_array(SIZE,a);		//Сортировка пузырьком
	print_array(SIZE,a);
	choose_sort_array(SIZE,a);		//Сортировка выбором - Непонятно!!!!!!!!!!!!!!!!!!!
	print_array(SIZE,a);
	return 0;
}

