/*
 * Naibolsh_obshiy_delitel.c
 * 
	Найти НОД двух чисел. - Наибольший общий делитель
	Алгоритм Евклида. НОД
	
	(14, 35) = НОД(14, 35-14)
	= НОД(14, 21) = НОД(14,
	21-14) = НОД(14, 7) =
	НОД(7, 7) = 7
	
	Модифицированный
	алгоритм Евклида. НОД
	
	(14, 35) = (14, 35%14) =
	НОД(14, 7) = НОД(14%7,
	7) = НОД(0, 7) = 7
 * 
 * 
 */


#include <stdio.h>

int main(int argc, char **argv)
{
	int a = 14;
	int b = 35;
	int t;
	printf("a=%d,b=%d,",a,b);
	while (b != 0)
		{
			t = b;
			b = a % b;
			a = t;
		}
	printf("NOD=%d\n",a);
	return 0;
}
