/*
 * S1_10.c
 * 
	Ввести целое число и определить количество цифр в нём
	Ввести целое число и определить сумму цифр в нём
	Ввести целое число и определить произведение цифр в нём
 * 
 * 
 */


#include <stdio.h>

int main()
{
    int n, d, count, sum=0, mult=1;
    printf("Input number: ");
    scanf("%d", &n);
    int n1=n;
//Цикл while-------------------------------------------------------
/*    count = 0;
    while (n != 0)
    {
        int d = n%10;
        sum += d;
        mult *= d;
        count ++;
        n = n / 10; // Отбросили одну цифру
    }
//-------------------------------------------------------------------
  */  
//Цикл for-------------------------------------------------------  
	for(count=0; n!=0; n/=10,count++) //в 3ем операторе (n/=10,count++)
									// после запятой не должно быть пробелов, иначе ошибка
	{
		d = n%10;
		sum += d;
		mult *= d;		
	}
    printf("In %d found %d digits mult=%d sum=%d", n1, count, mult, sum);
    return 0;
}

