/*
 * S3_6.c
 * 
 //----------------------------------------------------------------
	Синонимы выражений с указателями
//-----------------------------------------------------------------
	Синонимичные выражения
	
	pa = &pa[0];		<-->		pa = a;
	&a[i]				<-->		a + i;
	pa[i]				<-->		*(pa+i);
	char s[]			<-->		char* s
-------------------------------------------------------------------	
	Передача массива в функцию как параметра
	--------------------------------------------------
	int a[i]; // или			void f(int *array) {} // или
	f(a);	// или				void f(int array[])	{}
	f(&a[0]);							
									
	
-----------------------------------------------------------------		
	*(pa++) = n+3; 
	---------------------------------
	- Суть в том, что  у нас снчала увеличится адрес ++,*pa, 
	затем оперрация взятия адреса *, затем
	туда будет записано n + 3
	
	Операция инкремента меняет адрес (прибавляет 4 байта)
	
	*pa++ = n + 3;  -->  *pa = n + 3;
						 pa++;
 */


#include <stdio.h>
#include <stdlib.h>
#include <inttypes.h>

int sum(int a[], int size) 
{
	int i, s=0;
	for(i=0;i<size;i++)
		{
			s+=a[i];
		}
	return s;
}
/*
int sum(int *a, int size) 
{
	int i, s=0;
	for(i=0;i<size;i++)
		{
			s+=a[i];
		}
	return s;
}
*/
int main()
{
	int a[5] = {10,20,30,40,50};
	
	printf("%d\n",sum(a,5));	// = 150
	printf("%d\n",sum(a,2));	// = 30
	printf("%d\n",sum(a+2,3));	// = 120
	
	return 0;
}

