/*
 * getchar()_putchar().c
 * Данные функции считывают по одному символу из входной потока и выводят 
 * по одному символу в выходной поток
 * 
 * Вариации одной и той же записи
 */


#include <stdio.h>
#include <locale.h>


int main()
{
//------------------------------------------
/*	char c;
	c = getchar();
	while(c != '.')
		{
			putchar(c);
			c = getchar();
		}
	*/
//------------------------------------------------
/*	char c = getchar();
	
	while(c != '.')
		{
			putchar(c);
			c = getchar();
		}
*/
//------------------------------------------
/*	
	char c;
	while( (c=getchar())!='.')
		{
			putchar(c);
		}
*/
//---------------------------------------------------------------------
//Т.к. цикл с постусловием, то точка ('.') при выводе отобразится
//---------------------------------------------------------------------
	char character;
	puts("Введите символ, символ точки - выход('.'):");
	do
		{
			character = getchar(); // считать введённый со стандартного потока ввода символ
			putchar (character); // вывести этот символ
		} while (character != '.'); // пока введенный символ не точка
	
	return 0;
}

