#ifndef TEMP_API_H
#define TEMP_API_H

#include <stdlib.h>
#include <inttypes.h>

#define SIZE 30
//-----------------------------------------------------------------
typedef struct sensor sensor_t; //Переопределим тип для дальнейшего удобства
typedef struct data data_t; //Переопределим тип для дальнейшего удобства
//--------------------------------------------------------------------	
//----------------------------------------------------------------
//Ключевое слово struct, за ним название структуры sensor 
typedef struct sensor //Заполним поля структуры sensor
	{//Лучше начинать с самых больших полей, это связано с последующим выравниваем
		uint16_t year; //т.к год 2025, то используем тип uint_16 - самое большое поле
		uint8_t month; //месяц
		uint8_t day;// день
		uint8_t watch; //часы -----------------------------------------------------
		uint8_t minutes; //минуты ----------------------------------------------------		
		int8_t t;		//температура выбрали тип int т.к. от - до + 
	}sensor_t;//Задали имя пеменной sensor_t для структуры struct sensor и переобределили ее тип typedef
//----------------------------------------------------------------
typedef struct data
	{
		uint32_t number;
		struct sensor info[SIZE];
	}data_t; //Задали имя пеменной data_t для структуры struct data и переобределили ее тип typedef
//----------------------------------------------------------------
union sensor_serdes
	{
		data_t _data;
		uint8_t bytes[sizeof(data_t)];
	};


//--------------------------------------------------------------------
// Функции для работы с данными	
//--------------------------------------------------------------------
void AddRecord(sensor_t info[], int number, uint16_t year, uint8_t month, uint8_t day, uint8_t watch, uint8_t minutes, int8_t t);
//--------------------------------------------------------------------
// Функции заполнения массива данными	
//--------------------------------------------------------------------
int AddInfo(sensor_t info[]);
//--------------------------------------------------------------------
// Функции вывода массива данных на экран	
//--------------------------------------------------------------------
void print(sensor_t info[],int number);
//------------------------------------------------------------------
//Функция смены позиций двух элементов массива
//------------------------------------------------------------------
void cgangeIJ(sensor_t info[],int i, int j); 
//------------------------------------------------------------------
//Функция упорядочивания по температуре
//------------------------------------------------------------------
void SortByT(sensor_t info[],int n);
//------------------------------------------------------------------
//Вспомогательные функции упорядочивания по дате
//------------------------------------------------------------------
unsigned int DateToInt(sensor_t info[]);
int Compare(const void* va,const void* vb);//такие замены
//------------------------------------------------------------------
//Функция упорядочивания по дате
//------------------------------------------------------------------
void SortByDate(sensor_t info[],int n);
//-----------------------------------------------------------------
//Запишем данные в бинарный файл
//---------------------------------------------------------------	
void save_bin(sensor_t info[],int number); //Открыли файл на запись
//-----------------------------------------------------------------
//Считаем данные из бинарного файла
//---------------------------------------------------------------	
void load_bin(sensor_t info[],int number);	//Открыли файл на чтение	
//-----------------------------------------------------------------
//Добавим количество элементов с которыми мы работаем. Запишем их в начало файла 

//Считаем данные из бинарного файла
//---------------------------------------------------------------
void load_bin_d(data_t* d);
//-----------------------------------------------------------------
//Добавим количество элементов с которыми мы работаем. Запишем их в начало файла 
//Запишем данные в бинарный файл
//---------------------------------------------------------------	
void save_bin_d(data_t* d);
//---------------------------------------------------------------
void load_bin_des(union sensor_serdes * d);
void save_bin_ser(union sensor_serdes* d);

//-----------------------------------------------------------------
// Запишем данные из файла temperature.csv в union
//---------------------------------------------------------------
void load_temperature_csv_des(union sensor_serdes *d);
//----------------------------------------------------------------
//Функция ввода года с проверкой
//---------------------------------------------------------------
int input_year(const char *prompt); // 
//----------------------------------------------------------------
//Статистика за месяц
//---------------------------------------------------------------
//Среднемесячная температура
void SortBy_Аverage_monthly__T(sensor_t info[],int n, int year, int moth);
//---------------------------------------------------------------
//Минимальная температура в текущем месяце
void SortBy_min_T_in_the_current_month(sensor_t info[],int n, int year, int moth);
//---------------------------------------------------------------
//Максимальная температура в текущем месяце
void SortBy_max_T_in_the_current_month(sensor_t info[],int n, int year, int moth);

//----------------------------------------------------------------
//Статистика за год
//---------------------------------------------------------------
//Среднегодовая температура
void SortBy_Аverage_year__T(sensor_t info[],int n, int year);
//---------------------------------------------------------------
//Минимальная температура за год
void SortBy_min_T_for_the_year(sensor_t info[],int n, int year);
//---------------------------------------------------------------
//Максимальная температура за год
void SortBy_max_T_for_the_year(sensor_t info[],int n, int year);

#endif