/*
//------------------------------------------------------ 
// Вычисление интеграла
//------------------------------------------------------
// Методы вычисления площади
//------------------------------------------------------
● Формула прямоугольников
● Формула трапеций
● Формула Симпсона
● Метод Монте-Карло

//------------------------------------------------------
// Для чего нужны интегралы?
//------------------------------------------------------
● Вычисление площади кривой
● Расчет объема тела
● Определение центра масс тела
● Определение длины кривой
● Определение скорости и ускорения объекта
● Определение объема жидкости, находящейся в резервуаре
● Расчет интеграла импульса. Интегралы могут быть использованы
    для расчета импульса в физических и научных приложениях
    
*/

#include <stdio.h>    // ввод-вывод (printf и др.)
#include <math.h>

int main(void) 
{
    
    return 0;
}