/*-------------------------------------------------------------------
 * B1.c
 * ------------------------------------------------------------------
 * Всего памяти
 * ------------------------------------------------------------------
 Описана структура данных для хранения информации об использованной памяти:
typedef struct list {
void *address;
size_t size;
char comment[64];
struct list *next;
} list;
 
Требуется реализовать только одну функцию, которая анализирует 
данный список и возвращает сколько всего памяти используется. 
Адрес хранится в поле address, поле size - соответствующий 
размер данного блока. 
Если список пустой, то функция должна возвращать 0.
Прототип функции: size_t totalMemoryUsage(list *head)
------------------------------------------------------------------
*/


#include <stdio.h>      // printf, fprintf
#include <stdlib.h>     // malloc, free
#include <stdint.h>     // uintptr_t, uint64_t
#include <string.h>     // snprintf

//=========================================================================================
//   Описание узла списка
//==========================================================================================
typedef struct list {
void *address;
size_t size;
char comment[64];
struct list *next;
} list;
            

//=====================================================================================
size_t totalMemoryUsage(list *head)
{
   size_t max_block = 0;
    // Если список пуст — удалять нечего
    if (head == NULL)
    {
        return 0;
    }
//---------------------------------------------------------------------------------------
//Если мы получили адрес и он оказался адресом головы списка:
//----------------------------------------------------------------------------------------
    for( ;head != NULL; head = head->next)
    {
        max_block += head->size;
    }

    return max_block;
}

//===============================================================================================
//   Пример использования
//==============================================================================================
int main(void) 
{
   
    return 0;
}