/*
 * Imya_variables.c
 
 * 	Как выбрать имя переменной ?
 * 
 * ● Должно отражать суть того, для чего данная переменная
	используется
	● Составлять из нескольких английских слов
	● Избегайте использования однобуквенных переменных
	● Пеhеменные и идентификаторы пишутся в camelCase
	● Константы пишутся в SCREAMING_CASE
	
	Глобальные переменные
	
	● Нарушают инкапсуляцию -переменну можно изменять в разных файлах
	● Вызывают путаницу в большом проекте
	● Ухудшают масштабируемость проекта
	● Ухудшают читаемость кода
	● Приводят к трудно уловимым ошибкам
	● Увеличивают число прямых и косвенных связей в
	системе, делая её поведение трудно предсказуемым, а
	её саму – сложной для понимания
 * 
 */


#include <stdio.h>

int main()
{
	
	return 0;
}

