/*
//------------------------------------------------------
//        Библиотека ncurses.h
//------------------------------------------------------
ncurses.h — это библиотека функций, которая управляет
отображением приложения на терминалах с символьными ячейками.
📟 образует оболочку для работы с необработанными кодами
    терминала
📟 предоставляет функции для перемещения курсора, создания окон,
    создания цветов, игры с мышью и т. д.
    Прикладным программам больше не нужно беспокоиться о базовых
    возможностях терминала.
//------------------------------------------------------
// Особенности библиотека ncurses.h
//------------------------------------------------------
📟 Библиотека не только создаёт оболочку для использования терминала, но и
предоставляет надежную структуру для создания красивого
пользовательского интерфейса в текстовом режиме.
📟 Она предоставляет функции для создания окон, панелей, меню и т. д. Можно
создавать приложения, содержащие несколько окон, меню, панелей и форм.
📟 Все окна могут управляться независимо, можно реализовать «возможность
прокрутки» и даже минимизации окна.
//------------------------------------------------------
// Установка и компиляция Linux и Windows
//------------------------------------------------------
Под Linux: 
Установка командой sudo apt-get install libncursesw5-dev
Внимание! Для компиляции данного примера необходимо добавить ключ -lncurses.
            gcc -o prog main.c -lncurses
Под Windows:
1-ый способ msys-2 установка командой pacman -S ncurses ncurses - MSYS2 Packages
            gcc -o prog main.c -lncurses -DNCURSES_STATIC
how to install ncurses on windows - Stack Overflow
или https://packages.msys2.org/package/ncurses?repo=msys&variant=x86_64
https://stackoverflow.com/questions/75556484/how-to-install-ncurses-on-windows

Установка и компиляция Windows 2-ой способ:
Под Windows:
2-ой способ https://pdcurses.org/ нужно скачать и запустить mingw32-make для сборки в
каталоге \wincon
gcc.exe -Wall -std=c99 -g -ID:\geekbrains.ru\Projects\C\PDCurses-master -c main.c -o main.o
gcc.exe -o pdcurses_test2.exe main.o D:\geekbrains.ru\Projects\C\PDCurses-master\wincon\pdcurses.a
-ID:\geekbrains.ru\Projects\C\PDCurses-master

GitHub - wmcbrine/PDCurses: A curses library for environments that don't fit the termcap/terminfo model.
//------------------------------------------------------
// Hello world! в стиле ncurses
//------------------------------------------------------

*/
#include<ncurses.h>
#include<unistd.h>

int main() 
{
    initscr();
    printw("Hello World !!!");
    printw("\nPress any key to continue... ");
    refresh(); // попробуйте включить и выключить
    sleep(2);
    getch();
    endwin();//gcc -Wall -c "%f"
    return 0;//gcc -Wall -o "%e" "%f" -lncurses -DNCURSES_STATIC
}