/*
 * S1-7.c
 * 
 * //-------------------------------------------------------------
	Написать эквивалентное выражение, не содержащее 
	операции “!” - отрицание вначале
 * 
	! ( a>b )       		-	a <= b
	! ( 2*a == b+4 ) 		-	2a != b+4
	! ( a<b && c<d )		-	a >= b || c>= d
	! ( a<2 || a>5) 		-	a <= 2 && a <=5
	! ( a<1 || b<2 && c<3 ) - 	a >= 1 && (p >= 2 || c >= 3)
//------------------------------------------------------------	
	Истинно или ложно? 
	int a = 2, b = 3, c = 0, d = 0
	
	!(a > b)					-	t
	a < b && b < c				-	f
	!(a >= b) || c == d			-	t
	a < c || b < c && b < a		-	f
	a > b || !(b < c)			-	t
	
	Вот это в тетрадке: 
	1) 2 <= 3 true
	2) 2 < 3 && 3 < 0 false
	3) a < b || c == d ~ 2<3 || 0==0 true
	4) 2<0 || 3<0 && 3<2 false
	5) a>b || b>=c ~ 2>3 || 3>=0 true 
	
	//------------------------------------------------------
 * 	Переменная int x, если x=0 вывести “NO”, если “YES” 
 * с помощью if и тернарных операций
 * 
 *  x == 0 ? printf("NO") : printf("YES"); // Можно так....
 * 	printf("%s", x != 0 ? "YES" : "NO"); 	// Или так.....
 * 
 * Часто конструкцию x!=0 опускают и пишут просто x, т.к. 
 * Все что у нас не 0 - это считается истиной в языке C 
 */

#include <stdio.h>

int main()
{
	int x;
	scanf("%d", &x);
	 x == 0 ? printf("NO\n") : printf("YES\n"); // Можно так....
	 x ? printf("YES\n") : printf("NO\n");
  	printf("%s", x == 0 ? "NO\n" : "YES\n"); 	// Или так.....
    return 0;
}


